app/controllers/lessors_controller.rb

  def index
    @lessors = Lessor.all
---
SELECT "lessors".* FROM "lessors"

  def create
    @lessor = Lessor.new(lessor_params)

    respond_to do |format|
      if @lessor.save
---
INSERT INTO "lessors" ("name", "lastName", "telephone", "cellphone", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_lessor
      @lessor = Lessor.find(params[:id])
---
SELECT  "lessors".* FROM "lessors" WHERE "lessors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]