app/controllers/tenants_controller.rb

  def index
    @tenants = Tenant.all
---
SELECT "tenants".* FROM "tenants"